adamkondraciuk/nrfx/mdk/iar_startup_nrf7120_lmac.s
        PUBWEAK  LMACCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LMACCLIC_20_IRQHandler
        j .

        PUBWEAK  LMACCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LMACCLIC_21_IRQHandler
        j .

        PUBWEAK  LMACCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LMACCLIC_22_IRQHandler
        j .

        PUBWEAK  LMACCLIC_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LMACCLIC_23_IRQHandler
        j .

        PUBWEAK  RPU_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_0_IRQHandler
        j .

        PUBWEAK  RPU_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_1_IRQHandler
        j .

        PUBWEAK  RPU_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_2_IRQHandler
        j .

        PUBWEAK  RPU_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_3_IRQHandler
        j .

        PUBWEAK  RPU_EFS_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_EFS_0_IRQHandler
        j .

        PUBWEAK  RPU_EFS_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RPU_EFS_1_IRQHandler
        j .

        PUBWEAK  UMAC_VPR_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMAC_VPR_IRQHandler
        j .

        PUBWEAK  MVDMA_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA_IRQHandler
        j .

        PUBWEAK  SERIAL00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL00_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_0_IRQHandler
        j .

        PUBWEAK  BELLBOARD_WIFI_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_WIFI_1_IRQHandler
        j .

        PUBWEAK  SERIAL20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL20_IRQHandler
        j .

        PUBWEAK  SERIAL21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL21_IRQHandler
        j .

        PUBWEAK  SERIAL22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL22_IRQHandler
        j .

        PUBWEAK  GRTC_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_4_IRQHandler
        j .

        PUBWEAK  SERIAL23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL23_IRQHandler
        j .

        PUBWEAK  SERIAL24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL24_IRQHandler
        j .

        PUBWEAK  SERIAL30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL30_IRQHandler
        j .

        END


